In [1]:
!pip install psycopg2

Requirement already satisfied: psycopg2 in c:\programdata\anaconda3\lib\site-packages (2.8.3)

In [3]:
import pandas
import configparser
import psycopg2

In [ ]:
config = configparser.ConfigParser()
config.read('config.ini')

host = config['myaws'] ['host']
user = config['myaws']['user']
pwsd = config['myaws']['pwsd']
database = config['myaws']['database']
print(user)

# Q1

In [5]:
conn = psycopg2.connect( 
                            host = host,
                            user = user,
                            password = pwsd,
                            dbname = database
)

In [6]:
cur= conn.cursor()

In [13]:
sql_statement = '''
                select * from student_gp71
                '''

In [14]:
df=pandas.read_sql_query(sql_statement,conn)
df[:]

,email,name,major
0,jackie@gmail.jackie.com ...,Jackie James ...,Intelligence Analysis\n ...
1,rogers@gmail.rogers.com ...,Rogers Rogers ...,Intelligence Analysis ...
2,steve@gmail.steve.com ...,Steve Smith ...,Intelligence Analysis ...
3,robby@gmail.mayy.com ...,Robby Mayy ...,Intelligence Analysis\n ...
4,natalia@gmail ...,Natalia ...,Intelligence Analysis\n ...
5,linda@gmail.Lin.com ...,Linda Lin ...,Intelligence Analysis ...
6,demo_email ...,demo_name ...,GS ...

In [17]:
df = pandas.read_sql_query(sql_statement,conn)
df[:]

,email,name,major
0,jackie@gmail.jackie.com ...,Jackie James ...,Intelligence Analysis\n ...
1,rogers@gmail.rogers.com ...,Rogers Rogers ...,Intelligence Analysis ...
2,steve@gmail.steve.com ...,Steve Smith ...,Intelligence Analysis ...
3,robby@gmail.mayy.com ...,Robby Mayy ...,Intelligence Analysis\n ...
4,natalia@gmail ...,Natalia ...,Intelligence Analysis\n ...
5,linda@gmail.Lin.com ...,Linda Lin ...,Intelligence Analysis ...
6,demo_email ...,demo_name ...,GS ...

# Q2

In [23]:
sql_statement = '''
                select 
                name, count (temail)
                from course_gp71
                group by name
                order by count (temail) desc
                
                '''

In [24]:
df=pandas.read_sql_query(sql_statement,conn)
df[:]

                                                name  count
0  IA200                                         ...      1
1  IA999                                         ...      1
2  IA340                                         ...      1
3  IA549                                         ...      1
4  IA313                                         ...      1

# Q3

In [59]:
sql_statement = '''
                select 
                *
                from teacher_gp71
                inner join course_gp71
                on teacher_gp71.email = course_gp71.temail
                '''

In [60]:
df = pandas.read_sql_query(sql_statement,conn)
df[:]

,email,name,office,name,room,temail
0,taoqx@jmu.edu ...,Qingjiu Tao ...,ENGEO2107,IA549 ...,ENGEO1204,taoqx@jmu.edu ...
1,marrinsp@jmu.edu ...,Stephan Marrin ...,ENGEO2104,IA999 ...,ISAT450,marrinsp@jmu.edu ...
2,moore8ka@jmu.edu ...,Kathleen Moore ...,ISAT220,IA200 ...,ENGEO1207,moore8ka@jmu.edu ...
3,hendrinx@jmu.edu ...,Noel Hendrickson ...,ISAT250,IA313 ...,ISAT209,hendrinx@jmu.edu ...
4,congruent@gmail.com ...,Cindi ...,ISAT666,IA340 ...,ENGEO2010,congruent@gmail.com ...

# Q4

In [64]:
sql_statement = '''
                select 
                teacher_gp71.name as tname,
                count(course_gp71.name) as course_num
                from teacher_gp71
                inner join course_gp71
                on teacher_gp71.email = course_gp71.temail
                group by teacher_gp71.name
                limit 1
                '''

In [65]:
df = pandas.read_sql_query(sql_statement,conn)
df[:]

                                               tname  course_num
0  Noel Hendrickson                              ...           1

# Q5

In [37]:
sql_insert_statement = '''
                    insert into teacher_gp71(email,name,office)
                    values('{}','{}','{}')
                    '''.format('new_email1','new_name1','new_office1')
print(sql_insert_statement)

                    insert into teacher_gp71(email,name,office)
                    values('new_email1','new_name1','new_office1')

In [48]:
cur.execute(sql_insert_statement)

UniqueViolation: duplicate key value violates unique constraint "teacher_gp71_pkey"
DETAIL:  Key (email)=(new_email1                                                                                          ) already exists.

In [35]:
conn.commit()

In [36]:
df = pandas.read_sql_query('''select * from teacher_gp71''',conn)
df[:]

,email,name,office
0,marrinsp@jmu.edu ...,Stephan Marrin ...,ENGEO2104
1,hendrinx@jmu.edu ...,Noel Hendrickson ...,ISAT250
2,taoqx@jmu.edu ...,Qingjiu Tao ...,ENGEO2107
3,moore8ka@jmu.edu ...,Kathleen Moore ...,ISAT220
4,congruent@gmail.com ...,Cindi ...,ISAT666
5,new_email1 ...,new_name1 ...,new_office1
6,new_email2 ...,new_name2 ...,new_office2

# Q6

In [68]:
sql_statement = '''
                update course_gp71
                set temail = 'congruent@gmail.com'
                where temail= 'weixx@jmu.edu'
                '''

In [74]:
conn.commit()

In [75]:
cur.execute(sql_statement)

In [76]:
df = pandas.read_sql_query('''select * from teacher_gp71''',conn)
df[:]

,email,name,office
0,marrinsp@jmu.edu ...,Stephan Marrin ...,ENGEO2104
1,hendrinx@jmu.edu ...,Noel Hendrickson ...,ISAT250
2,taoqx@jmu.edu ...,Qingjiu Tao ...,ENGEO2107
3,moore8ka@jmu.edu ...,Kathleen Moore ...,ISAT220
4,congruent@gmail.com ...,Cindi ...,ISAT666
5,new_email1 ...,new_name1 ...,new_office1
6,new_email2 ...,new_name2 ...,new_office2

In [80]:
sql_statement = '''
                delete from teacher_gp71
                where email = 'weixx@jmu.edu'
                '''

In [81]:
conn.commit()

In [82]:
cur.execute(sql_statement)

In [84]:
df = pandas.read_sql_query('''select * from course_gp71''',conn)
df[:]

,name,room,temail
0,IA549 ...,ENGEO1204,taoqx@jmu.edu ...
1,IA999 ...,ISAT450,marrinsp@jmu.edu ...
2,IA200 ...,ENGEO1207,moore8ka@jmu.edu ...
3,IA313 ...,ISAT209,hendrinx@jmu.edu ...
4,IA340 ...,ENGEO2010,congruent@gmail.com ...